"""
    定义:JavaScript是运行在浏览器的脚本语言,由浏览器解释执行,简称js,
        能够让网页和用户有交互功能,增加良好的用户体验效果！！！
        特点: 弱类型和基于对象(因为面向对象需要具有封装, 继承, 多态的特征)
        三个核心:
            1. ECMAScript基本语法:
                1.1 区分大小写: 变量名, 函数名, 运算符以及其他一切都是区分大小写的
                1.2 属于弱类型语言
                1.3 语句之间的分割符: 可以是回车换行, 也可以是";"号(推荐)
                1.4 脚本注释: // 单行注释和 /* 多行注释 */
                1.5 花括号表示代码块: {}
                1.6 变量定义使用var关键字
                1.7 数据类型
                1.8 运算符
                1.9 数组
                1.10 分支语句
                1.11 循环语句
                1.12 函数
            2. DOM
            3. BOM
    前端开发三大模块:
        1.html:负责网页结构
        2.CSS:负责网页样式美化
        3.JavaScript:负责网页行为,比如网页与用户的交互效果
"""