"""
    数据类型相关函数:
        1. int(): 将其他数据类型转为int类型
        2. float(): 将其他数据类型转为float类型
        3. bool(): 将其他数据类型转为布尔类型
        4. complex(): 将其他数据类型转为复数类型
        5. str(): 将其他数据类型转为字符串类型
        6. list(): 将其他数据类型转为列表
        7. tuple(): 将其他数据类型转为元组
        8. dict(): 将其他数据类型转为字典
        9. set(): 将其他数据类型转为集合
    变量相关函数:
        1. id(): 获取当前数据的id标识
        2. type(): 获取当前数据的数据类型
        3. print(): 打印数据
        4. input(): 获取键盘输入数据
        5. isinstance(): 检测数据是否为指定数据类型
    数学相关函数:
        1. abs(x): 返回一个数(整数或浮点数)的绝对值, 如果是一个复数, 返回他的摸
        2. sum(iterable[, start]): 从start开始自左向右对iterable中的数据进行求和运算并返回计算值
        3. max(arg1, arg2, *args[, key]): 返回可迭代对象中最大的元素, 或者返回两个及以上实参中最大的
        4. min(arg1, arg2, *args[, key]): 返回可迭代对象中最小的元素, 或者返回两个及以上实参中最小的
        5. pow(x, y): 幂运算, 返回x的y次方
        6. round(): 四舍五入, (四舍六入, 五取偶数)
"""